In [96]:
import pandas as pd
import numpy as np

In [100]:
predict_df = pd.read_csv('../submit/KSY_Catboost_1.csv')
predict_df

        user_id        isbn    rating
0       11676.0  0002005018  6.386379
1      116866.0  0002005018  7.370847
2      152827.0  0060973129  6.734653
3      157969.0  0374157065  6.745891
4       67958.0  0399135782  7.635827
...         ...         ...       ...
76694  278543.0  1576734218  6.724958
76695  278563.0  3492223710  6.366926
76696  278633.0  1896095186  6.702135
76697  278668.0  8408044079  6.055797
76698  278851.0  0767907566  6.337922

[76699 rows x 3 columns]

In [101]:
predict_df.loc[predict_df['rating']>10,'rating']=10
predict_df.loc[predict_df['rating']<1,'rating']=1

In [102]:
predict_df.to_csv('../submit/KSY_Catboost_1.csv',index=False)

In [6]:
users = pd.read_csv('../data/users.csv')
ratings = pd.read_csv('../data/train_ratings.csv')
test_ratings = pd.read_csv('../data/test_ratings.csv')

In [5]:
ratings

        user_id        isbn  rating
0             8  0002005018       4
1         67544  0002005018       7
2        123629  0002005018       8
3        200273  0002005018       8
4        210926  0002005018       9
...         ...         ...     ...
306790   278843  0743525493       7
306791   278851  067161746X       6
306792   278851  0884159221       7
306793   278851  0912333022       7
306794   278851  1569661057      10

[306795 rows x 3 columns]

In [9]:
test_users = test_ratings['user_id'].unique()

In [47]:
df_count = pd.DataFrame(ratings['user_id'].value_counts().reset_index())
df_count.columns=['user_id','count']
df_count

       user_id  count
0        11676   5520
1        98391   4560
2       189835   1503
3       153662   1496
4        23902    956
...        ...    ...
59798    54908      1
59799   236844      1
59800    44531      1
59801    93836      1
59802   278713      1

[59803 rows x 2 columns]

In [60]:
df_user_rating = pd.merge(users,df_count,how='left',on='user_id').drop(columns=['location','age'])
df_user_rating

       user_id   count
0            8     7.0
1        11400    12.0
2        11676  5520.0
3        67544     7.0
4        85526   120.0
...        ...     ...
68087   278376     1.0
68088   278621     1.0
68089   278636     1.0
68090   278659     1.0
68091   278713     1.0

[68092 rows x 2 columns]

In [65]:
df_user_rating.loc[df_user_rating['count'].isna(),'count'] = 0
df_user_rating[df_user_rating['count']<10]

       user_id  count
0            8    7.0
3        67544    7.0
7       123629    1.0
9       200273    1.0
10      210926    5.0
...        ...    ...
68087   278376    1.0
68088   278621    1.0
68089   278636    1.0
68090   278659    1.0
68091   278713    1.0

[62708 rows x 2 columns]

In [69]:
df_user_rating = df_user_rating.astype({'count':int})

In [71]:
df_user_rating[df_user_rating['count']==0]

       user_id  count
50      248583      0
68      263256      0
86       12923      0
151      63470      0
231     116127      0
...        ...    ...
68047   275163      0
68049   275579      0
68055   276067      0
68070   277079      0
68075   277514      0

[8289 rows x 2 columns]

In [72]:
df_user_rating

       user_id  count
0            8      7
1        11400     12
2        11676   5520
3        67544      7
4        85526    120
...        ...    ...
68087   278376      1
68088   278621      1
68089   278636      1
68090   278659      1
68091   278713      1

[68092 rows x 2 columns]

In [73]:
df_user_rating.to_csv('../data/user_review_count.csv')

In [76]:
def cold_start_set(n: int=0) -> set():
    df = pd.read_csv('../data/user_review_count.csv')
    cold_user = set(df[df['count']<=n]['user_id'])
    return cold_user

In [103]:
cold_users = cold_start_set(0)

In [104]:
cold_users

{163845,
 98312,
 262152,
 32779,
 229392,
 131089,
 32791,
 196636,
 163869,
 163870,
 32799,
 163874,
 131110,
 196650,
 262190,
 51,
 262195,
 98358,
 229434,
 163905,
 32834,
 65605,
 73,
 196688,
 32848,
 83,
 98388,
 229459,
 131158,
 196699,
 229469,
 163936,
 65632,
 32867,
 229481,
 163946,
 262252,
 109,
 131183,
 131184,
 131190,
 229505,
 32909,
 32911,
 131217,
 32917,
 262297,
 32930,
 131236,
 196773,
 176,
 196787,
 65718,
 196795,
 65724,
 164029,
 190,
 32958,
 196799,
 131271,
 98505,
 164053,
 215,
 164055,
 65755,
 65760,
 98531,
 164085,
 98550,
 196856,
 164093,
 257,
 164098,
 131340,
 131345,
 262421,
 278,
 280,
 291,
 131369,
 196906,
 229674,
 98602,
 196910,
 164143,
 65839,
 98606,
 65846,
 262457,
 33081,
 326,
 262470,
 229705,
 332,
 33101,
 334,
 229711,
 196944,
 164173,
 164183,
 345,
 33113,
 164186,
 262492,
 196956,
 262494,
 164198,
 33126,
 196969,
 262507,
 164206,
 65904,
 131443,
 98679,
 65918,
 262535,
 98702,
 197016,
 197020,
 262556,
 33193,
 131498,
 33194,
 229807,
 432,
 98740,
 131513,
 164288,
 460,
 65999,
 98768,
 164312,
 33241,
 33244,
 262625,
 131554,
 131555,
 98791,
 489,
 197097,
 164332,
 493,
 229876,
 33269,
 262645,
 98808,
 197113,
 523,
 164367,
 530,
 66077,
 98847,
 131618,
 262690,
 66086,
 229928,
 131632,
 565,
 33336,
 33338,
 66109,
 197186,
 197188,
 229964,
 229972,
 131668,
 33365,
 98908,
 164450,
 262755,
 164455,
 33384,
 197226,
 131703,
 131705,
 66183,
 197258,
 98954,
 164494,
 131730,
 197272,
 197276,
 262813,
 98975,
 164517,
 683,
 66221,
 197299,
 164538,
 705,
 197315,
 708,
 99012,
 131780,
 33479,
 197319,
 99022,
 131791,
 33489,
 66266,
 131804,
 197342,
 131807,
 262883,
 230125,
 197358,
 99056,
 262901,
 164600,
 33533,
 197374,
 33535,
 66304,
 769,
 197375,
 230144,
 262921,
 230158,
 197396,
 230166,
 230174,
 66341,
 131882,
 164657,
 99124,
 164667,
 33596,
 262988,
 33618,
 262995,
 197462,
 197473,
 230244,
 197477,
 66407,
 33646,
 99184,
 33650,
 230258,
 99190,
 263030,
 66430,
 164735,
 902,
 99206,
 230281,
 197515,
 230286,
 197523,
 924,
 99228,
 33697,
 164779,
 941,
 132013,
 132017,
 263095,
 263101,
 263104,
 66497,
 965,
 164809,
 973,
 197582,
 66512,
 132053,
 66517,
 132062,
 132065,
 164836,
 999,
 99303,
 99306,
 1003,
 197613,
 33778,
 132085,
 33787,
 66563,
 66564,
 263173,
 33800,
 1038,
 1040,
 263193,
 99360,
 1057,
 263202,
 99363,
 230436,
 132144,
 132162,
 1094,
 263241,
 164938,
 263250,
 263256,
 263259,
 230493,
 164967,
 99432,
 33900,
 99442,
 33907,
 99446,
 164984,
 1150,
 33921,
 197767,
 66696,
 197768,
 263307,
 230547,
 1172,
 230550,
 132258,
 132261,
 197801,
 197805,
 197807,
 1200,
 263349,
 33979,
 99517,
 66751,
 1223,
 197831,
 33991,
 165069,
 34013,
 34014,
 263392,
 1250,
 34020,
 165092,
 34030,
 165104,
 34034,
 197879,
 34046,
 34055,
 230664,
 263434,
 1293,
 99598,
 132367,
 165139,
 197911,
 132376,
 230681,
 66839,
 263457,
 1314,
 263462,
 132395,
 1324,
 197937,
 34098,
 165171,
 263476,
 165175,
 165179,
 263487,
 263500,
 1359,
 1361,
 132433,
 99667,
 66900,
 230742,
 99677,
 132448,
 1377,
 34144,
 66917,
 1395,
 34167,
 263544,
 165242,
 263550,
 230785,
 1410,
 230786,
 66948,
 132485,
 198019,
 66952,
 230798,
 165266,
 165269,
 230814,
 66980,
 198055,
 263592,
 165290,
 198059,
 165294,
 66993,
 1461,
 99766,
 230838,
 198078,
 198081,
 67010,
 1475,
 34242,
 230850,
 132550,
 230854,
 263627,
 263628,
 165327,
 165328,
 99799,
 1504,
 263649,
 230889,
 1513,
 1515,
 165354,
 230898,
 132608,
 1539,
 99843,
 99848,
 132619,
 1550,
 67086,
 230933,
 1559,
 198169,
 198173,
 198176,
 198178,
 165418,
 99885,
 230962,
 1589,
 263742,
 132672,
 99912,
 132682,
 67147,
 132686,
 198222,
 34388,
 99939,
 34408,
 1641,
 132718,
 34415,
 1650,
 263794,
 165496,
 263802,
 198275,
 165515,
 231061,
 67226,
 231069,
 231076,
 132773,
 231080,
 67244,
 231084,
 165551,
 231088,
 132789,
 231105,
 34497,
 231117,
 1745,
 67286,
 198359,
 165592,
 1762,
 165606,
 198376,
 198380,
 1773,
 263918,
 165612,
 67312,
 132845,
 165616,
 67318,
 165622,
 263931,
 231163,
 231167,
 198400,
 67332,
 198407,
 1802,
 34577,
 1813,
 34584,
 34585,
 100127,
 165664,
 132905,
 198442,
 263979,
 231216,
 1841,
 165685,
 165688,
 198457,
 1859,
 132934,
 34631,
 165703,
 165706,
 165707,
 100172,
 132941,
 264012,
 67416,
 100186,
 100187,
 132960,
 100196,
 231270,
 198503,
 165736,
 264041,
 1900,
 100208,
 132982,
 231286,
 67448,
 34682,
 132986,
 231292,
 165760,
 165766,
 67464,
 165773,
 34703,
 133008,
 100241,
 1945,
 1961,
 34734,
 100273,
 264115,
 100276,
 231353,
 198590,
 264128,
 231361,
 34758,
 165831,
 264138,
 1995,
 198604,
 198608,
 231378,
 67543,
 198616,
 231387,
 231390,
 100318,
 2018,
 264162,
 67564,
 264174,
 67567,
 198641,
 2035,
 231412,
 133113,
 100359,
 133135,
 2066,
 67605,
 231446,
 2074,
 100387,
 100399,
 2099,
 67636,
 100403,
 198712,
 231483,
 198715,
 2109,
 34879,
 264264,
 34890,
 2127,
 100434,
 264275,
 231508,
 264277,
 231510,
 133207,
 100440,
 198754,
 133228,
 133238,
 34935,
 67704,
 34936,
 34944,
 133256,
 67725,
 231573,
 34966,
 166041,
 166049,
 2216,
 231592,
 34986,
 133291,
 67756,
 166060,
 2223,
 133298,
 264379,
 2240,
 100549,
 67786,
 2250,
 264401,
 166104,
 264408,
 100572,
 264415,
 2271,
 133346,
 35045,
 198895,
 264433,
 2292,
 35060,
 35065,
 166140,
 231680,
 133381,
 231687,
 133384,
 35089,
 35093,
 67861,
 231702,
 166172,
 2335,
 35109,
 198954,
 67887,
 231728,
 100658,
 35122,
 100662,
 231734,
 67901,
 264509,
 264511,
 198974,
 35138,
 133447,
 166217,
 35154,
 166230,
 100695,
 231768,
 231772,
 100703,
 35170,
 166242,
 199012,
 133479,
 35176,
 35177,
 35181,
 133486,
 67962,
 231814,
 231819,
 35220,
 100760,
 231834,
 133535,
 264613,
 100777,
 166315,
 100786,
 231859,
 68030,
 199105,
 100803,
 2501,
 100806,
 199113,
 264649,
 35278,
 68047,
 2515,
 231895,
 2520,
 35290,
 231899,
 68061,
 199142,
 35305,
 231914,
 133611,
 133612,
 100847,
 100868,
 35335,
 2569,
 133645,
 199182,
 68114,
 2578,
 68117,
 35350,
 2584,
 264731,
 100896,
 35362,
 2598,
 231977,
 264746,
 35371,
 133679,
 100912,
 264755,
 68150,
 231994,
 35398,
 68166,
 2633,
 166473,
 232011,
 133709,
 166478,
 100942,
 2640,
 35408,
 100946,
 2656,
 68203,
 100972,
 68220,
 2685,
 100990,
 232060,
 35465,
 101006,
 68241,
 264854,
 133787,
 35483,
 199327,
 264880,
 232112,
 166580,
 2749,
 199358,
 101054,
 68287,
 2759,
 68298,
 232141,
 199379,
 264916,
 166613,
 199393,
 133858,
 68321,
 232164,
 264929,
 68328,
 101102,
 133877,
 2808,
 133884,
 166657,
 199425,
 68376,
 2844,
 264993,
 199458,
 35619,
 68389,
 133933,
 133936,
 2864,
 166706,
 166709,
 68407,
 101176,
 199481,
 232251,
 101179,
 166731,
 166734,
 2896,
 166737,
 68440,
 199512,
 101210,
 133980,
 232288,
 232289,
 68450,
 2914,
 199522,
 35697,
 134010,
 134011,
 232316,
 2942,
 199553,
 2948,
 68484,
 68487,
 232328,
 265099,
 35730,
 68500,
 199578,
 2973,
 101283,
 68516,
 265126,
 199595,
 2991,
 2992,
 35764,
 199605,
 199609,
 3003,
 265151,
 35776,
 232392,
 101324,
 3026,
 68563,
 232410,
 101339,
 68571,
 265181,
 101343,
 199648,
 68578,
 166885,
 3062,
 232438,
 134143,
 3077,
 199686,
 101382,
 232453,
 101387,
 3089,
 166931,
 35864,
 166938,
 134172,
 68643,
 134181,
 68647,
 232490,
 68653,
 265262,
 134194,
 232503,
 101434,
 35899,
 101442,
 265284,
 265290,
 134222,
 232528,
 265299,
 3166,
 35935,
 167014,
 3174,
 68712,
 35945,
 3175,
 134251,
 134250,
 68721,
 35957,
 199797,
 3194,
 167037,
 199808,
 199811,
 134282,
 101515,
 232588,
 265358,
 232592,
 167062,
 35995,
 35997,
 167070,
 232608,
 68771,
 265380,
 167077,
 134313,
 134314,
 3243,
 101549,
 134318,
 3251,
 232634,
 68809,
 265422,
 232654,
 68816,
 134350,
 134354,
 101589,
 232667,
 3293,
 232669,
 3296,
 167144,
 134378,
 36075,
 199914,
 232691,
 232692,
 3320,
 265464,
 199930,
 265472,
 232717,
 199951,
 199953,
 167187,
 101654,
 68891,
 232738,
 199976,
 199983,
 199984,
 3379,
 3385,
 199998,
 134465,
 232785,
 167254,
 101722,
 167258,
 200030,
 36197,
 167277,
 36206,
 134510,
 265588,
 265592,
 101753,
 200063,
 200065,
 69001,
 36235,
 167309,
 265614,
 101784,
 36250,
 232862,
 69025,
 134568,
 36265,
 36268,
 200110,
 134582,
 36279,
 134584,
 232894,
 134590,
 3521,
 36291,
 265669,
 134598,
 36302,
 167374,
 265684,
 265686,
 134615,
 69079,
 101846,
 200154,
 101847,
 167388,
 69086,
 134629,
 36332,
 265710,
 265714,
 ...}

In [95]:
for i,j,k in df_user_rating.itertuples():
    print(j)
    break

8